@fingineering[ I bought a coffee and cloned your repo](https://github.com/noppGithub/tf-gcp-cloud-func-gcs) and try to run but has questions and errors below

### Questions
1. What is the meaning of `CODEEDITORUSER`, can I input any string ?
2. Which part of the `main.tf` that copy the local code to the `demoFunction` repository ?

### Error

This is the error after I run `cd ./Infrastructure/` > `terraform fmt` > `terraform init` > `terraform plan` > `terraform apply` > `yes`

```bash
nnopp@nnopp-pc:~/np/tf-gcp-cloud-func-gcs/Infrastructure$ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloudbuild_trigger.helloTrigger will be created
  + resource "google_cloudbuild_trigger" "helloTrigger" {
      + create_time     = (known after apply)
      + filename        = "HelloWorldFunction/cloudbuild.yaml"
      + id              = (known after apply)
      + name            = "hellotrigger"
      + project         = (known after apply)
      + service_account = (known after apply)
      + trigger_id      = (known after apply)

      + trigger_template {
          + branch_name = "main"
          + project_id  = "cc-test-01-354204"
          + repo_name   = "demoFunction"
        }
    }

  # google_cloudfunctions_function.helloWorldDemo will be created
  + resource "google_cloudfunctions_function" "helloWorldDemo" {
      + available_memory_mb           = 256
      + description                   = "A demo function to show how to create a google function"
      + entry_point                   = "hello_world"
      + environment_variables         = {
          + "ENVVAR" = "FooBar"
        }
      + https_trigger_url             = (known after apply)
      + id                            = (known after apply)
      + ingress_settings              = "ALLOW_ALL"
      + max_instances                 = 0
      + name                          = "hello_world"
      + project                       = (known after apply)
      + region                        = (known after apply)
      + runtime                       = "python39"
      + service_account_email         = (known after apply)
      + timeout                       = 300
      + vpc_connector_egress_settings = (known after apply)

      + event_trigger {
          + event_type = "google.storage.object.finalize"
          + resource   = "hello-gcs01"

          + failure_policy {
              + retry = (known after apply)
            }
        }

      + source_repository {
          + deployed_url = (known after apply)
          + url          = "https://source.developers.google.com/projects/cc-test-01-354204/repos/demoFunction/moveable-aliases/main/paths/HelloWorldFunction"
        }
    }

  # google_cloudfunctions_function_iam_binding.demoBuilderBinding will be created
  + resource "google_cloudfunctions_function_iam_binding" "demoBuilderBinding" {
      + cloud_function = "hello_world"
      + etag           = (known after apply)
      + id             = (known after apply)
      + members        = (known after apply)
      + project        = (known after apply)
      + region         = "europe-west3"
      + role           = "roles/cloudfunctions.developer"
    }

  # google_cloudfunctions_function_iam_binding.demoInvoke will be created
  + resource "google_cloudfunctions_function_iam_binding" "demoInvoke" {
      + cloud_function = "hello_world"
      + etag           = (known after apply)
      + id             = (known after apply)
      + members        = [
          + "hellouser",
        ]
      + project        = (known after apply)
      + region         = "europe-west3"
      + role           = "roles/cloudfunctions.invoker"
    }

  # google_project_iam_member.act_as will be created
  + resource "google_project_iam_member" "act_as" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "cc-test-01-354204"
      + role    = "roles/iam.serviceAccountUser"
    }

  # google_service_account.demo_builder will be created
  + resource "google_service_account" "demo_builder" {
      + account_id = "cloudbuilderaccount"
      + disabled   = false
      + email      = (known after apply)
      + id         = (known after apply)
      + name       = (known after apply)
      + project    = (known after apply)
      + unique_id  = (known after apply)
    }

  # google_service_account.demo_function will be created
  + resource "google_service_account" "demo_function" {
      + account_id = "cloudfunctionsaccount"
      + disabled   = false
      + email      = (known after apply)
      + id         = (known after apply)
      + name       = (known after apply)
      + project    = (known after apply)
      + unique_id  = (known after apply)
    }

  # google_sourcerepo_repository.demo_repo will be created
  + resource "google_sourcerepo_repository" "demo_repo" {
      + id      = (known after apply)
      + name    = "demoFunction"
      + project = (known after apply)
      + size    = (known after apply)
      + url     = (known after apply)
    }

  # google_sourcerepo_repository_iam_binding.demoEditors will be created
  + resource "google_sourcerepo_repository_iam_binding" "demoEditors" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + members    = [
          + "hellouser",
        ]
      + project    = "cc-test-01-354204"
      + repository = "demoFunction"
      + role       = "roles/editor"
    }

  # google_sourcerepo_repository_iam_binding.demoReader will be created
  + resource "google_sourcerepo_repository_iam_binding" "demoReader" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + members    = (known after apply)
      + project    = "cc-test-01-354204"
      + repository = "demoFunction"
      + role       = "roles/viewer"
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

google_sourcerepo_repository.demo_repo: Creating...
google_service_account.demo_function: Creating...
google_service_account.demo_builder: Creating...
google_service_account.demo_builder: Creation complete after 2s [id=projects/cc-test-01-354204/serviceAccounts/cloudbuilderaccount@cc-test-01-354204.iam.gserviceaccount.com]
google_project_iam_member.act_as: Creating...
google_service_account.demo_function: Creation complete after 2s [id=projects/cc-test-01-354204/serviceAccounts/cloudfunctionsaccount@cc-test-01-354204.iam.gserviceaccount.com]
google_sourcerepo_repository.demo_repo: Creation complete after 6s [id=projects/cc-test-01-354204/repos/demoFunction]
google_sourcerepo_repository_iam_binding.demoEditors: Creating...
google_sourcerepo_repository_iam_binding.demoReader: Creating...
google_cloudfunctions_function.helloWorldDemo: Creating...
google_sourcerepo_repository_iam_binding.demoReader: Creation complete after 5s [id=projects/cc-test-01-354204/repos/demoFunction/roles/viewer]
google_project_iam_member.act_as: Still creating... [10s elapsed]
google_project_iam_member.act_as: Creation complete after 10s [id=cc-test-01-354204/roles/iam.serviceAccountUser/serviceAccount:cloudbuilderaccount@cc-test-01-354204.iam.gserviceaccount.com]
google_cloudbuild_trigger.helloTrigger: Creating...
google_cloudfunctions_function.helloWorldDemo: Still creating... [10s elapsed]
╷
│ Error: Error applying IAM policy for sourcerepo repository "projects/cc-test-01-354204/repos/demoFunction": Error setting IAM policy for sourcerepo repository "projects/cc-test-01-354204/repos/demoFunction": googleapi: Error 400: Request contains an invalid argument.
│ Details:
│ [
│   {
│     "@type": "type.googleapis.com/google.rpc.LocalizedMessage",
│     "locale": "en-US",
│     "message": "APPLICATION_ERROR;tech.iam/CloudIAMInternal.SetPolicy;The member hellouser is of an unknown type. Please set a valid type prefix for the member.;AppErrorCode=3;StartTimeMs=1658298025566;unknown;Deadline(sec)=59.933;ResFormat=AUTOMATIC;ServerTimeSec=0.230542995;LogBytes=256;Non-FailFast;EffSecLevel=privacy_and_integrity;ReqFormat=AUTOMATIC;ReqID=be041f96b8b53bba;GlobalID=0;Server=[::1]:0"
│   },
│   {
│     "@type": "type.googleapis.com/google.rpc.RequestInfo",
│     "requestId": "835b75ed12e44f7795f6b56207c7e285"
│   }
│ ]
│ 
│   with google_sourcerepo_repository_iam_binding.demoEditors,
│   on main.tf line 58, in resource "google_sourcerepo_repository_iam_binding" "demoEditors":
│   58: resource "google_sourcerepo_repository_iam_binding" "demoEditors" {
│ 
╵
╷
│ Error: Error waiting for Creating CloudFunctions Function: Error code 5, message: Failed to retrieve function source code
│ 
│   with google_cloudfunctions_function.helloWorldDemo,
│   on main.tf line 80, in resource "google_cloudfunctions_function" "helloWorldDemo":
│   80: resource "google_cloudfunctions_function" "helloWorldDemo" {
│ 
╵
╷
│ Error: Error creating Trigger: googleapi: Error 409: trigger (187039241150, hellotrigger) already exists
│ 
│   with google_cloudbuild_trigger.helloTrigger,
│   on main.tf line 134, in resource "google_cloudbuild_trigger" "helloTrigger":
│  134: resource "google_cloudbuild_trigger" "helloTrigger" {
│ 
╵
```